Revit 2027 API
RebarFreeFormCreationResult.Error Property
 Identifies the error that occurs during the operation. Will be Success if everything is ok, otherwise the failure reason.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarFreeFormValidationResult Error { get; }
Public ReadOnly Property Error As RebarFreeFormValidationResult
	Get
public:
property RebarFreeFormValidationResult Error {
	RebarFreeFormValidationResult get ();
}
member Error : RebarFreeFormValidationResult with get
Property Value
RebarFreeFormValidationResult
See Also
Reference
RebarFreeFormCreationResult Class
Autodesk.Revit.DB.Structure Namespace